benchmarks/6_12_cospec_llama_13b/baseline_0_0_16_alpaca_output.txt
INFO 06-12 13:22:58 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='alpaca', dataset_path=None, max_concurrency=None, model='huggyllama/llama-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=16.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 52002 samples from cache from vicgalle/cache/alpaca_huggyllama/llama-13b.json
Split dataset into 5200 test samples and 46802 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     3993      
Benchmark duration (s):                  300.24    
Total input tokens:                      245655    
Total generated tokens:                  642393    
Request throughput (req/s):              13.30     
Output token throughput (tok/s):         2139.57   
Total Token throughput (tok/s):          2957.75   
---------------Time to First Token----------------
Mean TTFT (ms):                          7950.86   
Median TTFT (ms):                        7739.82   
P99 TTFT (ms):                           23252.38  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          102.99    
Median TPOT (ms):                        108.84    
P99 TPOT (ms):                           122.24    
---------------Inter-token Latency----------------
Mean ITL (ms):                           103.76    
Median ITL (ms):                         105.57    
P99 ITL (ms):                            153.79    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24539.60  
Median E2EL (ms):                        21286.91  
P99 E2EL (ms):                           67481.82  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 317.28    
Median Token Latency (ms):               154.57    
P99 Token Latency (ms):                  2094.84   
==================================================